# Do it Pandas 공부
## Date : 2020-09-22_ Day1_2

## 03 - 1. 나만의 데이터 만들기

- 시리즈와 데이터프레임 직접 만들기

In [1]:
import pandas as pd

In [3]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

- 인덱스 지정해주기

In [6]:
s = pd.Series(['Wes McKinney', 'Creator of pandas'], index=['Person', 'Who']) # index=[] 써주자
s

Person         Wes McKinney
Who       Creator of pandas
dtype: object

- 데이터프레임 만들기 : 딕셔너리 이용

In [8]:
df = {
    'Name' : ['Rosaline Franklin', 'William Gosset'],
    'Occupation' : ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
}
scientists = pd.DataFrame(df)
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [10]:
df = {
    'Occupation' : ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
}
scientists = pd.DataFrame(df, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation', 'Born', 'Age', 'Died'])
scientists # df는 O, B, D ,A 순서인데, 프레임 만들때 열 지정에서는 O, B, A, D로 하니 결과는 O, B, A, D로 나오더라

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

## 03 - 2. 시리즈 다루기 - 기초

### 데이터프레임에서 시리즈 선택하기

In [12]:
df = {
    'Occupation' : ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
}
scientists = pd.DataFrame(df, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation', 'Born', 'Died', 'Age'])
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [17]:
first_row = scientists.loc['William Gosset']
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

### 시리즈 속성과 메서드 사용하기 - index, values, keys

- index 속성 사용하기

In [19]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

- values 속성 사용하기

In [20]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

- keys 메서드 사용하기
    - keys는 속성이 아니라 메서드임, index 속성과 동일한 결과나옴

In [21]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

- index 속성 응용하기

In [23]:
first_row.index[1:3]

Index(['Born', 'Died'], dtype='object')

- keys 메서드 응용하기

In [24]:
first_row.keys()[1:3]

Index(['Born', 'Died'], dtype='object')

### 시리즈의 기초 통계 메서드 사용하기

- mean, min, max, std

In [26]:
ages = scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [27]:
ages.mean()

49.0

In [28]:
ages.min()

37

In [29]:
ages.max()

61

In [30]:
ages.std()

16.97056274847714

### 시리즈 메서드 정리

In [64]:
series_method = {
    '시리즈 메서드' :['append', 'describe', 'drop_duplicates', 'equals', 'get_values', 'isin', 'min', 'max', 'mean',
               'median', 'replace', 'sample', 'sort_values', 'to_frame'],
    '설명' : ['2개 이상의 시리즈 연결', '요약 통계량 계산', '중복값이 없는 시리즈 반환',
            '시리즈에 해당 값을 가진 요소가 있는지 확인', '시리즈 값 구하기(values 속성과 동일)',
           '시리즈에 포함된 값이 있는지 확인', '최솟값 반환', '최댓값 반환', '산술 평균 반환', '중간값 반환',
           '특정 값을 가진 시리즈 값을 교체', '시리즈에서 임의의 값을 반환', '값을 정렬', '시리즈를 데이터프레임으로 변환']
}

In [65]:
summary_method = pd.DataFrame(series_method)
summary_method

            시리즈 메서드                        설명
0            append             2개 이상의 시리즈 연결
1          describe                 요약 통계량 계산
2   drop_duplicates            중복값이 없는 시리즈 반환
3            equals  시리즈에 해당 값을 가진 요소가 있는지 확인
4        get_values  시리즈 값 구하기(values 속성과 동일)
5              isin        시리즈에 포함된 값이 있는지 확인
6               min                    최솟값 반환
7               max                    최댓값 반환
8              mean                  산술 평균 반환
9            median                    중간값 반환
10          replace        특정 값을 가진 시리즈 값을 교체
11           sample           시리즈에서 임의의 값을 반환
12      sort_values                     값을 정렬
13         to_frame          시리즈를 데이터프레임으로 변환

## 03 - 3. 시리즈 다루기 - 응용

### 시리즈와 불린 추출

In [66]:
scientists = pd.read_csv('./doit_pandas-master/doit_pandas-master/data/scientists.csv')

In [76]:
ages = scientists['Age']
ages.max()

90

In [77]:
ages = scientists['Age']
ages.mean()

59.125

In [78]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [80]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [81]:
type(ages>ages.mean())

pandas.core.series.Series

### 시리즈와 브로드캐스팅
- 모든 데이터에 대해 한 번에 연산하는 것(=Broadcasting)

In [82]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [83]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

- 스칼라 연산

In [85]:
ages * 100

0    3700
1    6100
2    9000
3    6600
4    5600
5    4500
6    4100
7    7700
Name: Age, dtype: int64

In [89]:
ages ** 3

0     50653
1    226981
2    729000
3    287496
4    175616
5     91125
6     68921
7    456533
Name: Age, dtype: int64

- **길이가 서로 다른 벡터** 연산은?

In [90]:
a = pd.Series([1, 10])

In [91]:
ages + a  #같은 인덱스끼리 연산함
# 2~ 7번 인덱스는 계산할 수 없으니 NaN 으로 표시

0    38.0
1    71.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

- 인덱스 역순

In [96]:
reverse_ages1 = ages.sort_index(ascending=False) # ascending=False
reverse_ages1

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

- 값 역순

In [97]:
reverse_ages2 = ages.sort_values(ascending=False)
reverse_ages2

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

- **연산 순서 주의**
    - ages + reverse_ages1 더하면 뭐가 될까?

In [98]:
aa = ages * 2

In [99]:
ages + reverse_ages1

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [100]:
aa == (ages + reverse_ages1)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
Name: Age, dtype: bool

- -> 그대로 더하는게 아니고 인덱스 번호로 더하는 것임. 주의할 것.

## 03 - 4. 데이터프레임 다루기
- 데이터프레임도 시리즈와 마찬가지로 불린 추출과 브로드캐스팅 가능

### 불린 추출과 브로드캐스팅

- 불린 추출하기

In [104]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [111]:
scientists[scientists['Age'] > scientists['Age'].mean()].loc[1]

Name          William Gosset
Born              1876-06-13
Died              1937-10-16
Age                       61
Occupation      Statistician
Name: 1, dtype: object

- 브로드캐스팅하기

In [114]:
scientists * 2 # 문자열은 2개로 늘러나고, 정수형은 2배 된다.

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 03 - 5. 시리즈와 데이터프레임의 데이터 처리하기